Class Diagram/CrashDriverClassDiagram.mmd
classDiagram

	class CrashDriverInfoClass{
	}

	CrashDriverInfoClass o-- DriverClass
	CrashDriverInfoClass o-- InjuredPersonClass
	CrashDriverInfoClass o-- CrashClass
	CrashDriverInfoClass o-- ChargeClass

	PersonClass <|-- DriverClass
	PersonClass <|-- InjuredPersonClass
	
	class PersonClass{
		+date BirthDate
		+string FirstName
		+string MiddleName
		+string LastName
	}
	
	class DriverClass{
		+String DriverLicenseNumber
		+String Email
	
	}

	class InjuredPersonClass{
		+string InjuryDescription
		+code SeverityCode
		+string InjuryPrivacyCode
		+boolean ThroughWindow
	}

	class ChargeClass{
		+string Description
		+boolean isFelony
		+boolean isCriminalInformation
	}

	class CrashClass{
		+date CrashDate
		+string CrashLocationCoordinates
	}

	PersonClass <--> ChargeClass
